podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/CSE_PRAM_S32K14x.svd.xml
<!--
Devices using this peripheral: 
      S32K142
      S32K144
      S32K146
      S32K148
-->
      <peripheral>
         <?sourceFile "CSE_PRAM_S32K14x" ?>
         <name>CSE_PRAM</name>
         <description>CSEc Parameter space RAM</description>
         <groupName>CSE_PRAM</groupName>
         <headerStructName>CSE_PRAM</headerStructName>
         <baseAddress>0x14001000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x80</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <cluster>
               <dim>32</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
               <name>RAMn,@p@f@i</name>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>DATA_32</name>
                  <description>CSE PRAM Register</description>
                  <addressOffset>0x0</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>BYTE_3</name>
                        <description>Data byte 3 of Rx/Tx frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>BYTE_2</name>
                        <description>Data byte 2 of Rx/Tx frame</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>BYTE_1</name>
                        <description>Data byte 1 of Rx/Tx frame</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>BYTE_0</name>
                        <description>Data byte 0 of Rx/Tx frame</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA_8LL</name>
                  <description>CSE PRAM0LL register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <resetMask>0xFF</resetMask>
                  <fields>
                     <field>
                        <name>RAM_LL</name>
                        <description>RAM_LL stores the first 8 bits of the 32 bit CRC</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA_8LU</name>
                  <description>CSE PRAM0LU register</description>
                  <addressOffset>0x1</addressOffset>
                  <size>8</size>
                  <resetMask>0xFF</resetMask>
                  <fields>
                     <field>
                        <name>RAM_LU</name>
                        <description>RAM_LU stores the second 8 bits of the 32 bit CRC</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA_8HL</name>
                  <description>CSE PRAM0HL register</description>
                  <addressOffset>0x2</addressOffset>
                  <size>8</size>
                  <resetMask>0xFF</resetMask>
                  <fields>
                     <field>
                        <name>RAM_HL</name>
                        <description>RAM_HL stores the third 8 bits of the 32 bit CRC</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA_8HU</name>
                  <description>CSE PRAM0HU register</description>
                  <addressOffset>0x3</addressOffset>
                  <size>8</size>
                  <resetMask>0xFF</resetMask>
                  <fields>
                     <field>
                        <name>RAM_HU</name>
                        <description>RAM_HU stores the fourth 8 bits of the 32 bit CRC</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
